tap "atlassian/cloudtoken", "git@bitbucket.org:atlassian/cloudtoken-homebrew-tap.git"
tap "felixkratz/formulae"
tap "homebrew/cask-fonts"
tap "joshmedeski/sesh"
tap "rcmdnk/file"
brew "ast-grep"
brew "bat"
brew "bitwarden-cli"
brew "btop"
brew "glib"
brew "harfbuzz"
brew "chafa"
brew "chezmoi"
brew "cloc"
brew "coreutils"
brew "direnv"
brew "dockutil"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-open"
brew "gnupg"
brew "gradle"
brew "grc"
brew "gum"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lesspipe"
brew "lnav"
brew "lua"
brew "luarocks"
brew "mas"
brew "mise"
brew "mvnvm"
brew "neovim"
brew "nmap"
brew "nowplaying-cli"
brew "onefetch"
brew "pandoc"
brew "pinentry-mac"
brew "poppler"
brew "pstree"
brew "pyenv"
brew "python-setuptools"
brew "ripgrep"
brew "sevenzip"
brew "switchaudio-osx"
brew "timewarrior"
brew "tldr"
brew "tmux"
brew "unar"
brew "wget"
brew "yarn"
brew "yazi", args: ["HEAD"]
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/sketchybar"
brew "joshmedeski/sesh/sesh"
cask "bitwarden"
cask "caffeine"
cask "cloudtoken"
cask "devtoys"
cask "discord"
cask "flameshot"
cask "font-commit-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
cask "homerow"
cask "intellij-idea-ce"
cask "raycast"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
cask "vivaldi"
cask "wezterm"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Lightshot Screenshot", id: 526298438
mas "MeetingBar", id: 1532419400
mas "Microsoft Excel", id: 462058435
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
vscode "atlassian.vscode-atlassian-tsserver"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "roscop.activefileinstatusbar"
