tap "homebrew/bundle"
tap "rcmdnk/file"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"
brew "git-open"
brew "gnupg"
brew "htop"
brew "jq"
brew "lazygit"
brew "sqlite"
brew "lnav"
brew "luarocks"
brew "mas"
brew "mise"
brew "neovim"
brew "nmap"
brew "onefetch"
brew "pinentry-mac"
brew "pstree"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "wget"
brew "yazi", args: ["HEAD"]
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "bitwarden"
cask "caffeine"
cask "clipy"
cask "devtoys"
cask "discord"
cask "docker"
cask "flameshot"
cask "font-blex-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "homerow"
cask "intellij-idea-ce"
cask "rectangle"
cask "skype"
cask "spotify"
cask "stats"
cask "steam"
cask "stretchly"
cask "sublime-text"
cask "visual-studio-code"
cask "wezterm"
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-docker"
vscode "roscop.activefileinstatusbar"
